**Load the required libraries and data**

In [1]:
# Load the libraries
import pandas as pd 
import numpy as np
from matplotlib import pyplot as plt
import seaborn as sns

In [2]:
# Load the data
May = pd.read_excel("data/May.xlsx")
June = pd.read_excel("data/June.xlsx")
July = pd.read_excel("data/July.xlsx")

# Explanatory Data Analysis
## Data Inspection and Cleaning 
View the first five rows of each dataset

In [3]:
May.head()

,Title,Price,Area,Bed,Bath,Furnished
0,"2 Bed Flat, Turner House, WC2R","£5,000 per month",0.43 km,2.0,2,Furnished
1,"1 Bed Flat, Bank Chambers, SW1Y","£2,578 per month",0.56 km,1.0,1,Furnished
2,"Studio Flat, Shaftesbury Avenue, W1D","£2,000 per month",0.57 km,NaN,1,Furnished
3,"2 Bed Flat, Rupert Street, W1D","£3,000 per month",0.65 km,2.0,2,Furnished
4,"1 Bed Flat, Old Compton Street, W1D","£1,950 per month",0.73 km,1.0,1,Furnished

In [4]:
June.head()

,Title,Price,Area,Bed,Bath,Furnished
0,"2 Bed Flat, Villiers Street, WC2N","£2,600 per month",0.29 km,2.0,1,Furnished
1,"2 Bed Flat, Bedfordbury, WC2N","£8,333 per month",0.4 km,2.0,2,Furnished
2,"1 Bed Flat, Bedford Street, WC2E","£2,362 per month",0.42 km,1.0,1,Unfurnished
3,"2 Bed Flat, Turner House, WC2R","£6,000 per month",0.43 km,2.0,2,Furnished
4,"Studio Flat, Shaftesbury Avenue, W1D","£1,950 per month",0.57 km,NaN,1,Furnished

In [5]:
July.head()

,Title,Price,Area,Bed,Bath,Furnished
0,"Room in a Shared Flat, London, E14","£1,100 per month",0.02 km,NaN,1,Furnishing at tenant choice
1,"3 Bed Flat, Norway House, SW1Y","£6,500 per month",0.15 km,3.0,2,Furnished
2,"Studio Flat, Craven Street, WC2N","£1,800 per month",0.23 km,NaN,1,Furnished
3,"1 Bed Flat, Craven Street, WC2N","£1,800 per month",0.23 km,1.0,1,Furnished
4,"1 Bed Flat, Oxendon Street, SW1Y","£2,470 per month",0.34 km,1.0,1,Furnished

Inspect the data info of one of the datasets

In [6]:
July.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2281 entries, 0 to 2280
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Title      2281 non-null   object
 1   Price      2241 non-null   object
 2   Area       2281 non-null   object
 3   Bed        1641 non-null   float64
 4   Bath       2281 non-null   int64
 5   Furnished  2281 non-null   object
dtypes: float64(1), int64(1), object(4)
memory usage: 107.0+ KB

In [7]:
# Add a column month and Concat the data
May["Month"] = "May"
June["Month"] = "June"
July["Month"] = "July"

# Concat the data rowwise
df = pd.concat([May, June, July])
# verify the operation
df.shape

(6237, 7)

**Strip the units from price(Euro sign) and area(km)**

In [8]:
# Strip the Units
df["Area"] = df["Area"].str.strip("km")

df["Price"] = df["Price"].str.strip("£")
df["Price"] = df["Price"].str.strip("per month")
df["Price"] = df["Price"].str.replace(",", "")

In [9]:
# convert to numeric
df["Area"] = pd.to_numeric(df["Area"])
df["Price"] = pd.to_numeric(df["Price"])

df.head()

,Title,Price,Area,Bed,Bath,Furnished,Month
0,"2 Bed Flat, Turner House, WC2R",5000.0,0.43,2.0,2,Furnished,May
1,"1 Bed Flat, Bank Chambers, SW1Y",2578.0,0.56,1.0,1,Furnished,May
2,"Studio Flat, Shaftesbury Avenue, W1D",2000.0,0.57,NaN,1,Furnished,May
3,"2 Bed Flat, Rupert Street, W1D",3000.0,0.65,2.0,2,Furnished,May
4,"1 Bed Flat, Old Compton Street, W1D",1950.0,0.73,1.0,1,Furnished,May

In [10]:
df.isna().sum()

Title           0
Price         120
Area            0
Bed          1802
Bath            0
Furnished       0
Month           0
dtype: int64

In [11]:
df["Price"].fillna(df["Price"].mean(), inplace=True)
df["Bed"].fillna(df["Bed"].mean(), inplace=True)

In [12]:
df.duplicated().sum()

289

In [13]:
# drop the duplicate rows while keeping the first one
df.drop_duplicates(keep="first", inplace=True)
df.duplicated().sum() #check again

0

## Data Visualization and Analysis